from colorama import Fore #pip install colorama

def dayMenu():
    print(r"""
    ⠀⠀⠀⠀⠀⠀⣤⢦⡤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢀⡾⠁⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢸⡀⠈⣇⢀⣀⣀⣀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⢘⣷⣄⣙⡏⠁⠀⠀⢬⣉⠙⠶⣄⣀⣀⣀⣠⣤⣤⡄⠀⠀⠀
⠀⠀⠀⠀⠀⢀⣼⠿⠟⠉⠉⠀⠀⠀⠀⠀⠉⠙⠛⢿⠉⠉⠁⠀⠀⢸⡇⠀⠀⠀
⠀⠀⠀⣀⣶⡿⠁⠀⠀⠀⠀⡄⠀⢰⣆⠀⠀⠀⠀⠘⣇⠀⠀⠀⢀⣸⡇⠀⠀⠀
⢴⠞⠛⠉⢹⡄⢰⡆⠀⠀⢸⢿⡆⠸⡟⣧⠀⠀⠀⠀⢹⡤⠶⠛⠛⣿⡅⠀⠀⠀
⠸⣇⠀⠀⠸⡇⢸⠀⠀⣶⣿⠤⠿⣆⣿⠙⣳⣄⠀⠀⠈⣧⠀⠀⣺⣽⠇⠀⠀⠀
⠀⠙⣶⣶⠿⡇⣾⡇⠀⣿⣿⣶⡄⠙⢿⡄⠏⠻⣷⣄⠀⢻⡶⢿⣿⠿⠂⠀⠀⠀
⠀⠀⠹⡆⠀⣿⠋⢷⡀⣿⡟⠇⠉⠀⠀⠁⠀⠀⢻⡼⣿⠿⠷⣾⣅⡀⠀⠀⠀⠀
⠀⠀⠀⠹⣾⣷⡶⠾⢷⣸⣷⡀⠀⠀⣆⣤⣴⣤⣾⡿⣏⣀⠀⢻⡿⠁⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢹⣧⣄⣤⠿⣿⣿⣿⢶⣶⣾⣯⣿⢿⠁⣸⠏⠙⠛⠶⣄⡀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⢠⣾⣿⠷⠈⢁⣿⣄⣻⣿⣹⣿⣼⣸⣧⠀⠀⠀⠀⢈⣷⠀⠀⠀
⠀⠀⠀⠀⣠⣶⠟⠋⠈⢳⣤⣾⡥⢽⡏⣿⠉⣸⡿⢯⣿⢷⣼⠃⠀⢸⡇⠀⠀⠀
⠀⠀⠀⠀⠻⣏⠀⠀⠀⣾⠁⢻⡟⠋⣿⣿⠀⣿⣀⣤⣿⣼⠛⠇⢀⡿⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠘⣇⠀⠀⠈⢷⣿⠟⠛⣻⡟⢀⡟⠄⢀⣿⡇⠀⠀⢸⡇⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢀⣸⣧⠀⠀⠀⣿⠆⢰⣿⢢⣼⠃⠀⣾⢿⡀⠀⠀⣼⣿⣷⢲⣦⡄
⠀⠀⠀⠐⣏⢻⣭⣿⡇⠀⣀⡿⠀⢸⣧⡾⣿⡀⠀⢡⣾⠻⢿⣴⣿⣿⣣⣾⠿⠀
⠀⠀⠀⠀⠹⣄⠻⠿⣣⣴⠿⠶⠶⡿⠉⣇⠈⢳⣤⠿⣿⣶⡟⠹⣿⠛⠋⠀⠀⠀
⠀⠀⠀⠀⠀⠹⢷⣾⣿⡟⠛⠶⢼⣇⣀⣿⣠⡴⢿⡖⠛⢯⣙⡾⠉⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠈⣿⣿⠷⠶⢤⣼⣇⣠⣽⣇⣠⣤⣷⡴⠞⢿⡄⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⣿⡆⠀⠀⠀⠉⠙⣷⠈⢷⣀⣤⠾⣶⣶⣾⣿⡄⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠘⣿⡤⡴⠒⣛⣛⣿⣄⣈⣻⡾⢋⠉⠀⠀⢹⣿⠀⠀⠀⠀⠀
    """)
    
    day = input("Введите день недели:")
    if day == "Понедельник":
        print("Утро: \tКаша и молоко\nОбед:\tКурица с рисом")

def shop():
    with open("product.txt","r", encoding="utf-8") as file:
        all_product = file.readlines()
        for product in all_product:
            print(product.strip())

def floor_calori():    # "м"
    pol = input("Выберите пол: \"м\" - мужской; \"ж\" - женский")
    if pol == "м":
        print("Ваш выбор - мужчина")
    elif pol == "ж":
        print("Ваш выбор - женщина")
    else:
        print("некорректный ввод")
        return
    weight = float(input("Введите Ваш вес(кг): "))
    height = float(input("Введите Ваш рос(см): "))
    age = float(input("Введите Ваш возраст: "))

    if pol == "м":
        bmr = 88.3 + (13.4 * weight) + (4.8 * height) - (5.7 * age)
    elif pol == "ж":
        bmr = 447.593 + (9.247 * weight) + (3.098 * height) - (4.33 * age)
    
    print("\nВаш образ жизни:")
    print("1. Сидячий")
    print("2. Тренировки 1-3 раза в неделю")
    print("3. Занятия 3-5 дней в неделю")
    print("4. Интенсивные тренировки 6-7 раз в неделю")
    print("5. Спортсмены, выполняющие упражнения чаще, чем раз в день")
    activity_choice = input("Введите один номер из вышеперечисленных: ")
    factor = {
        "1": 1.2,
        "2": 1.375,
        "3": 1.55,
        "4": 1.725,
        "5": 1.9,
    }
    if activity_choice in factor:
        your_calori = bmr * factor[activity_choice]
        print(f"{your_calori} - Ваша суточная норма калорий")
    else:
        print("Некорректный выбор")


while True:
    print(Fore.GREEN + "1. Меню на неделю")
    print("2. Калькулятор подсчета калорий")
    print("3. Магазин с продуктами")
    print("4. Список выбранных продуктов")
    print("5. Выход")

    choice = input("Выберите действие (1-5)")
    if choice == "1":
        print("Ваше меню на один день")
        dayMenu()
    elif choice == "2":
        print("Норма калорий")
        floor_calori()
    elif choice == "3":
        print("Наше меню")
        shop()
    elif choice == "4":
        print("Cписок выбранных продуктов")
    elif choice == "5":
        print("Конец")
        break
    else:
        print("Неверный ввод, попробуйте снова")
